MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_Display/DispTFT5.0/Arhiv/FlyRf_Disp_26_07_17_23/GL050001C0_40_Display.cpp
  for (uint8_t index = 0; index < displayState.targetCount; ++index) {
    const GL050001C0_40_Target &target = displayState.targets[index];
    const uint32_t maxVisibleMeters = (uint32_t)rangeMeters * 2U;
    if (target.distanceM == 0 || target.distanceM > maxVisibleMeters) {
      continue;
    }
    const float relativeAngle = ((int)target.bearingDeg - (int)displayState.courseDeg) * DEG_TO_RAD_LOCAL;
    float radius;
    if (target.distanceM <= rangeMeters) {
      radius = ((float)target.distanceM * 180.0f) / rangeMeters;
    } else {
      radius = 180.0f + ((float)(target.distanceM - rangeMeters) *
                         (targetRadius - 180.0f)) / rangeMeters;
    }
    const int x = centerX + (int)lroundf(sinf(relativeAngle) * radius);
    const int y = centerY - (int)lroundf(cosf(relativeAngle) * radius);
    const uint16_t color = targetColor(target.alarmLevel);
    fillCircle(x, y, 5, color);
    const float courseAngle = ((int)target.courseDeg - (int)displayState.courseDeg) * DEG_TO_RAD_LOCAL;
    drawLine(x, y, x + (int)lroundf(sinf(courseAngle) * 15),
             y - (int)lroundf(cosf(courseAngle) * 15), color);
    char label[20];
    snprintf(label, sizeof(label), "%+d", (int)target.relativeAltitudeM);
    drawSmoothString(x + 8, y - 7, label, color, FONT_SMALL);
  }
}

static void drawStatusBlocks()
{
  char buffer[48];
  snprintf(buffer, sizeof(buffer), "LoRa Tx %lu", (unsigned long)displayState.loraTxPackets);
  drawSmoothString(8, 412, buffer, COLOR_STATUS_TEXT, FONT_TINY);
  snprintf(buffer, sizeof(buffer), "LoRa Rx %lu", (unsigned long)displayState.loraRxPackets);
  drawSmoothString(8, 433, buffer, COLOR_STATUS_TEXT, FONT_TINY);
  if (displayState.loraRfHz != 0) {
    snprintf(buffer, sizeof(buffer), "LoRa RF %.3f", displayState.loraRfHz / 1000000.0f);
  } else {
    snprintf(buffer, sizeof(buffer), "LoRa RF ---");
  }
  drawSmoothString(8, 454, buffer, COLOR_STATUS_TEXT, FONT_TINY);
  if (displayState.loraRssiDb < 0) {
    snprintf(buffer, sizeof(buffer), "LoRa RSSI %d dB", (int)displayState.loraRssiDb);
  } else {
    snprintf(buffer, sizeof(buffer), "LoRa RSSI ---");
  }
  drawSmoothString(8, 475, buffer, COLOR_STATUS_TEXT, FONT_TINY);

  snprintf(buffer, sizeof(buffer), "GPS Sat %u", (unsigned)displayState.satellites);
  drawSmoothString(615, 433, buffer, COLOR_STATUS_TEXT, FONT_TINY);
  if (displayState.gnssValid) {
    snprintf(buffer, sizeof(buffer), "GPS Lat %.5f", displayState.latitude);
    drawSmoothString(615, 454, buffer, COLOR_STATUS_TEXT, FONT_TINY);
    snprintf(buffer, sizeof(buffer), "GPS Lon %.5f", displayState.longitude);
    drawSmoothString(615, 475, buffer, COLOR_STATUS_TEXT, FONT_TINY);
  } else {
    drawSmoothString(615, 454, "GPS Lat ---", COLOR_STATUS_TEXT, FONT_TINY);
    drawSmoothString(615, 475, "GPS Lon ---", COLOR_STATUS_TEXT, FONT_TINY);
  }
}

static void drawTopBar()
{
  char buffer[48];
  if (displayState.timeValid) {
    snprintf(buffer, sizeof(buffer), "%02u:%02u", (unsigned)displayState.hour, (unsigned)displayState.minute);
  } else {
    snprintf(buffer, sizeof(buffer), "--:--");
  }
  drawSmoothString(8, 32, buffer, COLOR_TEXT, FONT_LARGE);

  if (displayState.powerValid) {
    snprintf(buffer, sizeof(buffer), "%.2f V  %.0f mA",
             displayState.voltageV, displayState.currentMa);
  } else {
    snprintf(buffer, sizeof(buffer), "POWER ---");
  }
  drawSmoothString(540, 27, buffer, COLOR_TEXT, FONT_SMALL);
  drawBatteryIcon(690, 8, displayState.batteryPercent, displayState.powerValid);
  if (displayState.powerValid) {
    snprintf(buffer, sizeof(buffer), "%u%%", (unsigned)displayState.batteryPercent);
  } else {
    snprintf(buffer, sizeof(buffer), "---");
  }
  drawSmoothString(747, 27, buffer, COLOR_TEXT, FONT_SMALL);
}

static void drawOperationalFrame()
{
  fillRect(0, 0, LCD_WIDTH, LCD_HEIGHT, COLOR_SCREEN_BG);
  drawRadar();
  drawStatusBlocks();
  drawTopBar();
  drawTargetTable();

  if (!displayState.baseConnected) {
    drawSmoothStringCentered(400, 245, "НЕТ СВЯЗИ С БАЗОЙ", COLOR_RED, FONT_LARGE);
  }

  if (displayState.sosActive) {
    fillRect(300, 275, 200, 78, COLOR_SCREEN_BG);
    drawRectOutline(300, 275, 200, 78, COLOR_WARN);
    drawSmoothStringCentered(400, 329, "SOS", COLOR_WARN, FONT_MEDIUM);
  }
}

static void flushFrame()
{
  if (ready && panel != NULL && frameBuffer != NULL) {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    // Кадр уже находится во внутреннем framebuffer драйвера. Перезапуск по VSYNC
    // начинает его передачу с первого пикселя и исключает постоянное смещение DMA.
    esp_lcd_rgb_panel_restart(panel);
#else
    esp_lcd_panel_draw_bitmap(panel, 0, 0, LCD_WIDTH, LCD_HEIGHT, frameBuffer);
#endif
  }
}

static const uint8_t *glyphFor(char c)
{
  static const uint8_t space[7] = {0, 0, 0, 0, 0, 0, 0};
  static const uint8_t dash[7] = {0, 0, 0, 0x1F, 0, 0, 0};
  static const uint8_t colon[7] = {0, 0x04, 0x04, 0, 0x04, 0x04, 0};
  static const uint8_t dot[7] = {0, 0, 0, 0, 0, 0x0C, 0x0C};
  static const uint8_t underscore[7] = {0, 0, 0, 0, 0, 0, 0x1F};
  static const uint8_t leftParen[7] = {0x02, 0x04, 0x08, 0x08, 0x08, 0x04, 0x02};
  static const uint8_t rightParen[7] = {0x08, 0x04, 0x02, 0x02, 0x02, 0x04, 0x08};
  static const uint8_t zero[7] = {0x0E, 0x11, 0x13, 0x15, 0x19, 0x11, 0x0E};
  static const uint8_t one[7] = {0x04, 0x0C, 0x04, 0x04, 0x04, 0x04, 0x0E};
  static const uint8_t two[7] = {0x0E, 0x11, 0x01, 0x02, 0x04, 0x08, 0x1F};
  static const uint8_t three[7] = {0x1E, 0x01, 0x01, 0x0E, 0x01, 0x01, 0x1E};
  static const uint8_t four[7] = {0x02, 0x06, 0x0A, 0x12, 0x1F, 0x02, 0x02};
  static const uint8_t five[7] = {0x1F, 0x10, 0x10, 0x1E, 0x01, 0x01, 0x1E};
  static const uint8_t six[7] = {0x0E, 0x10, 0x10, 0x1E, 0x11, 0x11, 0x0E};
  static const uint8_t seven[7] = {0x1F, 0x01, 0x02, 0x04, 0x08, 0x08, 0x08};
  static const uint8_t eight[7] = {0x0E, 0x11, 0x11, 0x0E, 0x11, 0x11, 0x0E};
  static const uint8_t nine[7] = {0x0E, 0x11, 0x11, 0x0F, 0x01, 0x01, 0x0E};
  static const uint8_t letters[26][7] = {
    {0x0E, 0x11, 0x11, 0x1F, 0x11, 0x11, 0x11},
    {0x1E, 0x11, 0x11, 0x1E, 0x11, 0x11, 0x1E},
    {0x0E, 0x11, 0x10, 0x10, 0x10, 0x11, 0x0E},
    {0x1E, 0x11, 0x11, 0x11, 0x11, 0x11, 0x1E},
    {0x1F, 0x10, 0x10, 0x1E, 0x10, 0x10, 0x1F},
    {0x1F, 0x10, 0x10, 0x1E, 0x10, 0x10, 0x10},
    {0x0E, 0x11, 0x10, 0x17, 0x11, 0x11, 0x0F},
    {0x11, 0x11, 0x11, 0x1F, 0x11, 0x11, 0x11},
    {0x0E, 0x04, 0x04, 0x04, 0x04, 0x04, 0x0E},
    {0x01, 0x01, 0x01, 0x01, 0x11, 0x11, 0x0E},
    {0x11, 0x12, 0x14, 0x18, 0x14, 0x12, 0x11},
    {0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x1F},
    {0x11, 0x1B, 0x15, 0x15, 0x11, 0x11, 0x11},
    {0x11, 0x19, 0x15, 0x13, 0x11, 0x11, 0x11},
    {0x0E, 0x11, 0x11, 0x11, 0x11, 0x11, 0x0E},
    {0x1E, 0x11, 0x11, 0x1E, 0x10, 0x10, 0x10},
    {0x0E, 0x11, 0x11, 0x11, 0x15, 0x12, 0x0D},
    {0x1E, 0x11, 0x11, 0x1E, 0x14, 0x12, 0x11},
    {0x0F, 0x10, 0x10, 0x0E, 0x01, 0x01, 0x1E},
    {0x1F, 0x04, 0x04, 0x04, 0x04, 0x04, 0x04},
    {0x11, 0x11, 0x11, 0x11, 0x11, 0x11, 0x0E},
    {0x11, 0x11, 0x11, 0x11, 0x0A, 0x0A, 0x04},
    {0x11, 0x11, 0x11, 0x15, 0x15, 0x1B, 0x11},
    {0x11, 0x11, 0x0A, 0x04, 0x0A, 0x11, 0x11},
    {0x11, 0x11, 0x0A, 0x04, 0x04, 0x04, 0x04},
    {0x1F, 0x01, 0x02, 0x04, 0x08, 0x10, 0x1F}
  };

  if (c >= 'a' && c <= 'z') {
    c -= 32;
  }
  if (c >= 'A' && c <= 'Z') {
    return letters[c - 'A'];
  }
  switch (c) {
    case '0': return zero;
    case '1': return one;
    case '2': return two;
    case '3': return three;
    case '4': return four;
    case '5': return five;
    case '6': return six;
    case '7': return seven;
    case '8': return eight;
    case '9': return nine;
    case '-': return dash;
    case ':': return colon;
    case '.': return dot;
    case '_': return underscore;
    case '(': return leftParen;
    case ')': return rightParen;
    default: return space;
  }
}

static void drawChar(int x, int y, char c, uint16_t color, int scale)
{
  const uint8_t *glyph = glyphFor(c);
  for (int row = 0; row < 7; ++row) {
    for (int col = 0; col < 5; ++col) {
      if (glyph[row] & (1 << (4 - col))) {
        fillRect(x + col * scale, y + row * scale, scale, scale, color);
      }
    }
  }
}

static void drawText(int x, int y, const String &text, uint16_t color, int scale)
{
  int cursor = x;
  for (size_t i = 0; i < text.length(); ++i) {
    drawChar(cursor, y, text[i], color, scale);
    cursor += 6 * scale;
  }
}

static int textWidth(const String &text, int scale)
{
  if (text.length() == 0) {
    return 0;
  }
  return (int)text.length() * 6 * scale - scale;
}

static void drawTextCentered(int y, const String &text, uint16_t color, int scale)
{
  drawText((LCD_WIDTH - textWidth(text, scale)) / 2, y, text, color, scale);
}

