MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_Display/DispTFT5.0/Arhiv/FlyRf_Disp_26_07_17_23/GL050001C0_40_Display.cpp
enum CyrillicGlyph {
  CYR_A,
  CYR_V,
  CYR_D,
  CYR_E,
  CYR_ZH,
  CYR_I,
  CYR_SHORT_I,
  CYR_K,
  CYR_L,
  CYR_O,
  CYR_S,
  CYR_T,
  CYR_CH,
  CYR_YU,
  CYR_YA
};

static const uint8_t CYRILLIC_GLYPHS[][7] = {
  {0x0E, 0x11, 0x11, 0x1F, 0x11, 0x11, 0x11}, // A
  {0x1E, 0x11, 0x11, 0x1E, 0x11, 0x11, 0x1E}, // V
  {0x0E, 0x0A, 0x0A, 0x12, 0x12, 0x1F, 0x11}, // D
  {0x1F, 0x10, 0x10, 0x1E, 0x10, 0x10, 0x1F}, // E
  {0x15, 0x15, 0x0E, 0x04, 0x0E, 0x15, 0x15}, // ZH
  {0x11, 0x11, 0x13, 0x15, 0x19, 0x11, 0x11}, // I
  {0x0A, 0x04, 0x11, 0x13, 0x15, 0x19, 0x11}, // SHORT I
  {0x11, 0x12, 0x14, 0x18, 0x14, 0x12, 0x11}, // K
  {0x03, 0x05, 0x09, 0x11, 0x11, 0x11, 0x11}, // L
  {0x0E, 0x11, 0x11, 0x11, 0x11, 0x11, 0x0E}, // O
  {0x0E, 0x11, 0x10, 0x10, 0x10, 0x11, 0x0E}, // S
  {0x1F, 0x04, 0x04, 0x04, 0x04, 0x04, 0x04}, // T
  {0x11, 0x11, 0x11, 0x0F, 0x01, 0x01, 0x01}, // CH
  {0x12, 0x15, 0x15, 0x1D, 0x15, 0x15, 0x12}, // YU
  {0x0F, 0x11, 0x11, 0x0F, 0x05, 0x09, 0x11}  // YA
};

static void drawCyrillicChar(int x, int y, CyrillicGlyph glyphIndex,
                             uint16_t color, int scale, bool italic)
{
  const uint8_t *glyph = CYRILLIC_GLYPHS[glyphIndex];
  for (int row = 0; row < 7; ++row) {
    const int italicOffset = italic ? (6 - row) * scale / 3 : 0;
    for (int col = 0; col < 5; ++col) {
      if (glyph[row] & (1 << (4 - col))) {
        fillRect(x + italicOffset + col * scale, y + row * scale,
                 scale, scale, color);
      }
    }
  }
}

static void drawCyrillicWordCentered(int y, const CyrillicGlyph *word,
                                     size_t length, uint16_t color, int scale)
{
  const int glyphStep = 7 * scale;
  const int width = (int)length * glyphStep - 2 * scale;
  int x = (LCD_WIDTH - width) / 2;
  for (size_t i = 0; i < length; ++i) {
    drawCyrillicChar(x, y, word[i], color, scale, true);
    x += glyphStep;
  }
}

static void drawShell()
{
  drawStartupBackground();
  drawSmoothStartupText();
  shellDrawn = true;
}

static void ensureShell()
{
  if (!shellDrawn) {
    drawShell();
  }
}

bool GL050001C0_40_setup()
{
#if !GL050001C0_40_PINMAP_CONFIRMED
  Serial.println(F("[GL050001C0-40] RGB panel is disabled: not enough free GPIOs in the current FlyRF pinout."));
  Serial.println(F("[GL050001C0-40] Move peripherals first, then set GL050001C0_40_PINMAP_CONFIRMED=1 and fill the pin map."));
  return false;
#else
  esp_lcd_rgb_panel_config_t config = {};
  config.data_width = 16;
  config.bits_per_pixel = 16;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  config.dma_burst_size = 64;
#else
  config.psram_trans_align = 64;
  config.sram_trans_align = 4;
#endif
  config.disp_gpio_num = LCD_PIN_DISP_EN;
  config.pclk_gpio_num = LCD_PIN_PCLK;
  config.vsync_gpio_num = LCD_PIN_VSYNC;
  config.hsync_gpio_num = LCD_PIN_HSYNC;
  config.de_gpio_num = LCD_PIN_DE;
  for (int i = 0; i < 16; ++i) {
    config.data_gpio_nums[i] = LCD_PIN_DATA[i];
  }
  // 18 МГц оставляет запас пропускной способности PSRAM для активного Wi-Fi.
  config.timings.pclk_hz = 18000000;
  config.timings.h_res = LCD_WIDTH;
  config.timings.v_res = LCD_HEIGHT;
  config.timings.hsync_pulse_width = 64;
  config.timings.hsync_back_porch = 80;
  config.timings.hsync_front_porch = 42;
  config.timings.vsync_pulse_width = 2;
  config.timings.vsync_back_porch = 34;
  config.timings.vsync_front_porch = 38;
  config.flags.fb_in_psram = true;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  config.num_fbs = 1;
  // Два внутренних DMA-буфера по 10 строк сглаживают паузы PSRAM при работе Wi-Fi.
  config.bounce_buffer_size_px = LCD_WIDTH * 10;
  config.flags.bb_invalidate_cache = false;
#endif

  esp_err_t err = esp_lcd_new_rgb_panel(&config, &panel);
  if (err != ESP_OK) {
    Serial.print(F("[GL050001C0-40] panel allocation failed: "));
    Serial.println(err);
    panel = NULL;
    return false;
  }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  void *driverFrameBuffer = NULL;
  err = esp_lcd_rgb_panel_get_frame_buffer(panel, 1, &driverFrameBuffer);
  if (err != ESP_OK || driverFrameBuffer == NULL) {
    Serial.print(F("[GL050001C0-40] driver framebuffer request failed: "));
    Serial.println(err);
    panel = NULL;
    return false;
  }
  frameBuffer = static_cast<uint16_t *>(driverFrameBuffer);
#else
  frameBuffer = (uint16_t *)heap_caps_malloc(LCD_WIDTH * LCD_HEIGHT * sizeof(uint16_t),
                                            MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
  if (frameBuffer == NULL) {
    Serial.println(F("[GL050001C0-40] PSRAM framebuffer allocation failed"));
    panel = NULL;
    return false;
  }
#endif

  // Заполняем framebuffer до запуска RGB DMA, чтобы панель не читала пустую память.
  drawShell();

  err = esp_lcd_panel_reset(panel);
  if (err == ESP_OK) {
    err = esp_lcd_panel_init(panel);
  }
  if (err != ESP_OK) {
    Serial.print(F("[GL050001C0-40] panel init failed: "));
    Serial.println(err);
    panel = NULL;
    return false;
  }

  ready = true;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  Serial.println(F("[GL050001C0-40] RGB panel initialized: direct driver framebuffer, PCLK 18 MHz, bounce buffer 10 lines, DMA burst 64 bytes"));
#else
  Serial.println(F("[GL050001C0-40] RGB panel initialized: PCLK 18 MHz"));
#endif
  return true;
#endif
}

void GL050001C0_40_showStartup(const String &version)
{
  if (!ready) {
    return;
  }

  (void)version;
  ensureShell();
  flushFrame();
  startupShownMs = millis();
  operationalFrameShown = false;
}

void GL050001C0_40_showStatus(uint32_t rxPackets, uint32_t txPackets)
{
  displayState.rs485RxPackets = rxPackets;
  displayState.rs485TxPackets = txPackets;
}

void GL050001C0_40_updateState(const GL050001C0_40_State &state)
{
  displayState = state;
  stateAvailable = true;
}

bool GL050001C0_40_needsFrameUpdate()
{
  return ready && !operationalFrameShown;
}
void GL050001C0_40_showPowerOff()
{
  if (!ready) {
    return;
  }

  drawShell();
  flushFrame();
}

void GL050001C0_40_loop()
{
  const uint32_t nowMs = millis();
  if (!ready || !stateAvailable ||
      operationalFrameShown ||
      (uint32_t)(nowMs - startupShownMs) < 3000UL) {
    return;
  }
  drawOperationalFrame();
  flushFrame();
  operationalFrameShown = true;
  delay(1);
}
